{
  "<pad>": 0,
  "<unk>": 1,
  "'d": 2,
  "'hare": 3,
  "'ll": 4,
  "'m": 5,
  "'re": 6,
  "'s": 7,
  "'t": 8,
  "'ve": 9,
  "0900": 10,
  "1": 11,
  "10": 12,
  "100": 13,
  "1000": 14,
  "1017": 15,
  "1020": 16,
  "1024": 17,
  "1026": 18,
  "1030": 19,
  "1039": 20,
  "1045": 21,
  "1055": 22,
  "1059": 23,
  "106": 24,
  "1083": 25,
  "11": 26,
  "110": 27,
  "1100": 28,
  "1110": 29,
  "1115": 30,
  "1130": 31,
  "1133": 32,
  "1145": 33,
  "1158": 34,
  "12": 35,
  "1200": 36,
  "1205": 37,
  "1209": 38,
  "1220": 39,
  "1222": 40,
  "1230": 41,
  "124": 42,
  "1245": 43,
  "1288": 44,
  "1291": 45,
  "130": 46,
  "1300": 47,
  "137338": 48,
  "139": 49,
  "150": 50,
  "1500": 51,
  "1505": 52,
  "1600": 53,
  "163": 54,
  "1700": 55,
  "1765": 56,
  "1850": 57,
  "19": 58,
  "1940": 59,
  "1991": 60,
  "1992": 61,
  "1993": 62,
  "2": 63,
  "200": 64,
  "201": 65,
  "21": 66,
  "210": 67,
  "2100": 68,
  "212": 69,
  "2134": 70,
  "2153": 71,
  "217": 72,
  "225": 73,
  "229": 74,
  "230": 75,
  "257": 76,
  "269": 77,
  "270": 78,
  "271": 79,
  "279": 80,
  "281": 81,
  "296": 82,
  "297": 83,
  "3": 84,
  "300": 85,
  "305": 86,
  "311": 87,
  "315": 88,
  "323": 89,
  "324": 90,
  "329": 91,
  "3357": 92,
  "343": 93,
  "345": 94,
  "352": 95,
  "3724": 96,
  "4": 97,
  "400": 98,
  "402": 99,
  "405": 100,
  "415": 101,
  "416": 102,
  "417": 103,
  "420": 104,
  "428": 105,
  "43": 106,
  "430": 107,
  "4400": 108,
  "445": 109,
  "459": 110,
  "466": 111,
  "497766": 112,
  "5": 113,
  "500": 114,
  "505": 115,
  "515": 116,
  "530": 117,
  "539": 118,
  "55": 119,
  "555": 120,
  "57": 121,
  "6": 122,
  "615": 123,
  "630": 124,
  "645": 125,
  "650": 126,
  "7": 127,
  "705": 128,
  "71": 129,
  "718": 130,
  "720": 131,
  "723": 132,
  "727": 133,
  "72s": 134,
  "730": 135,
  "733": 136,
  "734": 137,
  "737": 138,
  "73s": 139,
  "746": 140,
  "747": 141,
  "755": 142,
  "757": 143,
  "767": 144,
  "771": 145,
  "8": 146,
  "80": 147,
  "810": 148,
  "813": 149,
  "815": 150,
  "819": 151,
  "82": 152,
  "823": 153,
  "825": 154,
  "838": 155,
  "845": 156,
  "852": 157,
  "9": 158,
  "928": 159,
  "932": 160,
  "934": 161,
  "98": 162,
  "a": 163,
  "aa": 164,
  "abbreviation": 165,
  "abbreviations": 166,
  "able": 167,
  "about": 168,
  "ac": 169,
  "across": 170,
  "actually": 171,
  "advertises": 172,
  "after": 173,
  "afternoon": 174,
  "afternoons": 175,
  "afterwards": 176,
  "again": 177,
  "air": 178,
  "aircraft": 179,
  "airfare": 180,
  "airfares": 181,
  "airline": 182,
  "airlines": 183,
  "airplane": 184,
  "airplanes": 185,
  "airport": 186,
  "airports": 187,
  "alaska": 188,
  "all": 189,
  "along": 190,
  "also": 191,
  "am": 192,
  "america": 193,
  "american": 194,
  "amount": 195,
  "an": 196,
  "and": 197,
  "angeles": 198,
  "another": 199,
  "any": 200,
  "anything": 201,
  "anywhere": 202,
  "ap": 203,
  "ap57": 204,
  "ap68": 205,
  "ap80": 206,
  "approximately": 207,
  "april": 208,
  "are": 209,
  "area": 210,
  "arizona": 211,
  "around": 212,
  "arrange": 213,
  "arrangements": 214,
  "arrival": 215,
  "arrivals": 216,
  "arrive": 217,
  "arrives": 218,
  "arriving": 219,
  "as": 220,
  "at": 221,
  "atl": 222,
  "atlanta": 223,
  "august": 224,
  "available": 225,
  "b": 226,
  "back": 227,
  "baltimore": 228,
  "bay": 229,
  "be": 230,
  "beach": 231,
  "before": 232,
  "beginning": 233,
  "begins": 234,
  "being": 235,
  "belong": 236,
  "besides": 237,
  "between": 238,
  "bna": 239,
  "boeing": 240,
  "book": 241,
  "booking": 242,
  "boston": 243,
  "both": 244,
  "bound": 245,
  "breakfast": 246,
  "bring": 247,
  "bur": 248,
  "burbank": 249,
  "business": 250,
  "but": 251,
  "buy": 252,
  "bwi": 253,
  "by": 254,
  "c": 255,
  "california": 256,
  "calling": 257,
  "can": 258,
  "canada": 259,
  "canadian": 260,
  "capacities": 261,
  "capacity": 262,
  "car": 263,
  "carolina": 264,
  "carried": 265,
  "carries": 266,
  "cars": 267,
  "catch": 268,
  "charges": 269,
  "charlotte": 270,
  "cheap": 271,
  "cheapest": 272,
  "chicago": 273,
  "choices": 274,
  "cincinnati": 275,
  "cities": 276,
  "city": 277,
  "class": 278,
  "classes": 279,
  "cleveland": 280,
  "close": 281,
  "closest": 282,
  "co": 283,
  "coach": 284,
  "code": 285,
  "codes": 286,
  "colorado": 287,
  "columbus": 288,
  "come": 289,
  "coming": 290,
  "companies": 291,
  "concerning": 292,
  "connect": 293,
  "connecting": 294,
  "connection": 295,
  "connections": 296,
  "connects": 297,
  "continent": 298,
  "continental": 299,
  "continuing": 300,
  "cost": 301,
  "costs": 302,
  "could": 303,
  "county": 304,
  "cover": 305,
  "cp": 306,
  "currently": 307,
  "d": 308,
  "d10": 309,
  "d9s": 310,
  "daily": 311,
  "dallas": 312,
  "database": 313,
  "date": 314,
  "day": 315,
  "days": 316,
  "dc": 317,
  "dc10": 318,
  "december": 319,
  "define": 320,
  "delta": 321,
  "denver": 322,
  "depart": 323,
  "departing": 324,
  "departs": 325,
  "departure": 326,
  "departures": 327,
  "describe": 328,
  "designate": 329,
  "destination": 330,
  "determine": 331,
  "detroit": 332,
  "dfw": 333,
  "diego": 334,
  "difference": 335,
  "different": 336,
  "dinner": 337,
  "dinnertime": 338,
  "direct": 339,
  "directly": 340,
  "discount": 341,
  "display": 342,
  "distance": 343,
  "dl": 344,
  "do": 345,
  "does": 346,
  "doesn": 347,
  "dollars": 348,
  "don": 349,
  "downtown": 350,
  "dulles": 351,
  "during": 352,
  "ea": 353,
  "each": 354,
  "earlier": 355,
  "earliest": 356,
  "early": 357,
  "eastern": 358,
  "economic": 359,
  "economy": 360,
  "eight": 361,
  "eighteenth": 362,
  "eighth": 363,
  "either": 364,
  "eleven": 365,
  "eleventh": 366,
  "else": 367,
  "enroute": 368,
  "equal": 369,
  "equipment": 370,
  "evening": 371,
  "everywhere": 372,
  "ewr": 373,
  "expensive": 374,
  "explain": 375,
  "express": 376,
  "eye": 377,
  "f": 378,
  "f28": 379,
  "far": 380,
  "fare": 381,
  "fares": 382,
  "february": 383,
  "ff": 384,
  "field": 385,
  "fifteen": 386,
  "fifteenth": 387,
  "fifth": 388,
  "final": 389,
  "find": 390,
  "fine": 391,
  "first": 392,
  "fit": 393,
  "flies": 394,
  "flight": 395,
  "flights": 396,
  "florida": 397,
  "fly": 398,
  "flying": 399,
  "fn": 400,
  "following": 401,
  "for": 402,
  "fort": 403,
  "four": 404,
  "fourteenth": 405,
  "fourth": 406,
  "francisco": 407,
  "friday": 408,
  "fridays": 409,
  "friends": 410,
  "from": 411,
  "general": 412,
  "georgia": 413,
  "get": 414,
  "gets": 415,
  "give": 416,
  "go": 417,
  "goes": 418,
  "going": 419,
  "got": 420,
  "great": 421,
  "greatest": 422,
  "ground": 423,
  "grounds": 424,
  "guardia": 425,
  "h": 426,
  "hartfield": 427,
  "has": 428,
  "have": 429,
  "having": 430,
  "heading": 431,
  "hello": 432,
  "help": 433,
  "here": 434,
  "hi": 435,
  "highest": 436,
  "hold": 437,
  "home": 438,
  "hopefully": 439,
  "hou": 440,
  "hours": 441,
  "houston": 442,
  "how": 443,
  "hp": 444,
  "i": 445,
  "iah": 446,
  "if": 447,
  "in": 448,
  "include": 449,
  "includes": 450,
  "including": 451,
  "indiana": 452,
  "indianapolis": 453,
  "inexpensive": 454,
  "inform": 455,
  "information": 456,
  "instead": 457,
  "intercontinental": 458,
  "interested": 459,
  "international": 460,
  "into": 461,
  "is": 462,
  "it": 463,
  "itinerary": 464,
  "j31": 465,
  "january": 466,
  "jersey": 467,
  "jet": 468,
  "jfk": 469,
  "jose": 470,
  "july": 471,
  "june": 472,
  "just": 473,
  "k": 474,
  "kansas": 475,
  "kind": 476,
  "kindly": 477,
  "kinds": 478,
  "know": 479,
  "la": 480,
  "lake": 481,
  "land": 482,
  "landing": 483,
  "landings": 484,
  "lands": 485,
  "largest": 486,
  "las": 487,
  "last": 488,
  "lastest": 489,
  "late": 490,
  "later": 491,
  "latest": 492,
  "lax": 493,
  "laying": 494,
  "layover": 495,
  "least": 496,
  "leave": 497,
  "leaves": 498,
  "leaving": 499,
  "less": 500,
  "lester": 501,
  "let": 502,
  "level": 503,
  "like": 504,
  "limo": 505,
  "limousine": 506,
  "limousines": 507,
  "list": 508,
  "listed": 509,
  "listing": 510,
  "listings": 511,
  "live": 512,
  "lives": 513,
  "local": 514,
  "locate": 515,
  "located": 516,
  "logan": 517,
  "long": 518,
  "longest": 519,
  "look": 520,
  "looking": 521,
  "los": 522,
  "louis": 523,
  "love": 524,
  "lowest": 525,
  "ls": 526,
  "lufthansa": 527,
  "lunch": 528,
  "m": 529,
  "m80": 530,
  "make": 531,
  "makes": 532,
  "making": 533,
  "many": 534,
  "march": 535,
  "maximum": 536,
  "may": 537,
  "mco": 538,
  "me": 539,
  "meal": 540,
  "meals": 541,
  "mealtime": 542,
  "mean": 543,
  "meaning": 544,
  "memphis": 545,
  "mia": 546,
  "miami": 547,
  "michigan": 548,
  "midnight": 549,
  "midway": 550,
  "midwest": 551,
  "milwaukee": 552,
  "minimum": 553,
  "minneapolis": 554,
  "minnesota": 555,
  "missouri": 556,
  "mitchell": 557,
  "monday": 558,
  "mondays": 559,
  "month": 560,
  "montreal": 561,
  "more": 562,
  "morning": 563,
  "mornings": 564,
  "most": 565,
  "much": 566,
  "must": 567,
  "my": 568,
  "name": 569,
  "names": 570,
  "nashville": 571,
  "nationair": 572,
  "near": 573,
  "need": 574,
  "nevada": 575,
  "new": 576,
  "newark": 577,
  "next": 578,
  "night": 579,
  "nights": 580,
  "nighttime": 581,
  "nineteenth": 582,
  "ninth": 583,
  "no": 584,
  "non": 585,
  "nonstop": 586,
  "nonstops": 587,
  "noon": 588,
  "noontime": 589,
  "north": 590,
  "northwest": 591,
  "november": 592,
  "now": 593,
  "number": 594,
  "numbers": 595,
  "nw": 596,
  "o": 597,
  "o'clock": 598,
  "oak": 599,
  "oakland": 600,
  "october": 601,
  "of": 602,
  "off": 603,
  "offer": 604,
  "offered": 605,
  "offers": 606,
  "oh": 607,
  "ohio": 608,
  "okay": 609,
  "on": 610,
  "once": 611,
  "one": 612,
  "only": 613,
  "ontario": 614,
  "operating": 615,
  "operation": 616,
  "options": 617,
  "or": 618,
  "ord": 619,
  "order": 620,
  "originate": 621,
  "originating": 622,
  "orlando": 623,
  "other": 624,
  "out": 625,
  "over": 626,
  "overnight": 627,
  "passengers": 628,
  "paul": 629,
  "pearson": 630,
  "pennsylvania": 631,
  "people": 632,
  "petersburg": 633,
  "philadelphia": 634,
  "philly": 635,
  "phoenix": 636,
  "pittsburgh": 637,
  "place": 638,
  "plan": 639,
  "plane": 640,
  "planes": 641,
  "planning": 642,
  "please": 643,
  "pm": 644,
  "possible": 645,
  "prefer": 646,
  "preferably": 647,
  "price": 648,
  "priced": 649,
  "prices": 650,
  "proper": 651,
  "provide": 652,
  "provided": 653,
  "provides": 654,
  "put": 655,
  "q": 656,
  "qo": 657,
  "qualify": 658,
  "quebec": 659,
  "question": 660,
  "qw": 661,
  "qx": 662,
  "rate": 663,
  "rates": 664,
  "reaches": 665,
  "reaching": 666,
  "red": 667,
  "regarding": 668,
  "rent": 669,
  "rental": 670,
  "rentals": 671,
  "repeat": 672,
  "repeating": 673,
  "represented": 674,
  "requesting": 675,
  "reservation": 676,
  "reservations": 677,
  "restriction": 678,
  "restrictions": 679,
  "return": 680,
  "returning": 681,
  "reverse": 682,
  "right": 683,
  "round": 684,
  "route": 685,
  "run": 686,
  "runs": 687,
  "s": 688,
  "sa": 689,
  "salt": 690,
  "same": 691,
  "san": 692,
  "saturday": 693,
  "saturdays": 694,
  "say": 695,
  "scenario": 696,
  "schedule": 697,
  "scheduled": 698,
  "schedules": 699,
  "sd": 700,
  "seat": 701,
  "seating": 702,
  "seats": 703,
  "seattle": 704,
  "second": 705,
  "see": 706,
  "september": 707,
  "serve": 708,
  "served": 709,
  "serves": 710,
  "service": 711,
  "serviced": 712,
  "services": 713,
  "serving": 714,
  "seven": 715,
  "seventeen": 716,
  "seventeenth": 717,
  "seventh": 718,
  "sfo": 719,
  "shortest": 720,
  "should": 721,
  "show": 722,
  "single": 723,
  "six": 724,
  "sixteen": 725,
  "sixteenth": 726,
  "sixth": 727,
  "smallest": 728,
  "snack": 729,
  "so": 730,
  "some": 731,
  "somebody": 732,
  "sometime": 733,
  "soon": 734,
  "sorry": 735,
  "sort": 736,
  "sounds": 737,
  "southwest": 738,
  "spend": 739,
  "st.": 740,
  "stand": 741,
  "stands": 742,
  "stapleton": 743,
  "start": 744,
  "starting": 745,
  "staying": 746,
  "still": 747,
  "stop": 748,
  "stopover": 749,
  "stopovers": 750,
  "stopping": 751,
  "stops": 752,
  "straight": 753,
  "such": 754,
  "summer": 755,
  "sunday": 756,
  "sundays": 757,
  "supper": 758,
  "sure": 759,
  "symbols": 760,
  "tacoma": 761,
  "take": 762,
  "takeoff": 763,
  "takeoffs": 764,
  "takes": 765,
  "taking": 766,
  "tampa": 767,
  "taxi": 768,
  "tell": 769,
  "ten": 770,
  "tennessee": 771,
  "tenth": 772,
  "texas": 773,
  "than": 774,
  "thank": 775,
  "thanks": 776,
  "that": 777,
  "the": 778,
  "their": 779,
  "them": 780,
  "then": 781,
  "there": 782,
  "thereafter": 783,
  "these": 784,
  "they": 785,
  "thing": 786,
  "third": 787,
  "thirteenth": 788,
  "thirtieth": 789,
  "thirty": 790,
  "this": 791,
  "those": 792,
  "three": 793,
  "thrift": 794,
  "through": 795,
  "thursday": 796,
  "thursdays": 797,
  "ticket": 798,
  "tickets": 799,
  "time": 800,
  "times": 801,
  "to": 802,
  "today": 803,
  "tomorrow": 804,
  "tonight": 805,
  "too": 806,
  "toronto": 807,
  "total": 808,
  "toward": 809,
  "tower": 810,
  "town": 811,
  "train": 812,
  "trans": 813,
  "transcontinental": 814,
  "transport": 815,
  "transportation": 816,
  "travel": 817,
  "traveling": 818,
  "travels": 819,
  "trip": 820,
  "trips": 821,
  "try": 822,
  "trying": 823,
  "tuesday": 824,
  "tuesdays": 825,
  "turboprop": 826,
  "twa": 827,
  "twelfth": 828,
  "twelve": 829,
  "twentieth": 830,
  "twenty": 831,
  "two": 832,
  "type": 833,
  "types": 834,
  "ua": 835,
  "under": 836,
  "united": 837,
  "up": 838,
  "us": 839,
  "usa": 840,
  "use": 841,
  "used": 842,
  "uses": 843,
  "using": 844,
  "utah": 845,
  "various": 846,
  "vegas": 847,
  "very": 848,
  "via": 849,
  "vicinity": 850,
  "visit": 851,
  "want": 852,
  "wanted": 853,
  "wants": 854,
  "washington": 855,
  "way": 856,
  "we": 857,
  "wednesday": 858,
  "wednesdays": 859,
  "week": 860,
  "weekday": 861,
  "weekdays": 862,
  "well": 863,
  "west": 864,
  "westchester": 865,
  "what": 866,
  "when": 867,
  "where": 868,
  "whether": 869,
  "which": 870,
  "while": 871,
  "who": 872,
  "will": 873,
  "wish": 874,
  "with": 875,
  "within": 876,
  "without": 877,
  "working": 878,
  "world": 879,
  "worth": 880,
  "would": 881,
  "y": 882,
  "year": 883,
  "yes": 884,
  "yn": 885,
  "york": 886,
  "you": 887,
  "your": 888,
  "yyz": 889,
  "zone": 890
}